Repository: jnahuel-developer/landing_page
Catalog: lib/l10n/app_*.arb
Languages: es, it

# serviceIosLongDescription
source: Development of iOS applications with modern and fluid interfaces, designed to provide a reliable experience for iPhone and iPad users. My projects include integration with cloud services, data synchronization, and API connections, ensuring your app is complete, secure, and scalable. The goal is to create apps that not only work well but also bring real value to your business or venture.
es: Desarrollo de aplicaciones para iOS con interfaces modernas y fluidas, pensadas para brindar una experiencia confiable a los usuarios de iPhone y iPad. Mis desarrollos contemplan la integración de servicios en la nube, sincronización de datos y conexión con APIs, asegurando que tu aplicación sea completa, segura y escalable. El objetivo es crear apps que no solo funcionen bien, sino que generen valor real para tu negocio o emprendimiento.
it: Sviluppo di applicazioni iOS con interfacce moderne e fluide, progettate per offrire un’esperienza affidabile agli utenti di iPhone e iPad. I miei progetti prevedono l’integrazione con servizi cloud, sincronizzazione dei dati e connessione con API, garantendo che l’app sia completa, sicura e scalabile. L’obiettivo è creare applicazioni che non solo funzionino bene, ma che portino un reale valore alla tua attività o impresa.

# serviceAndroidExamples
source: • Client management app • Appointment scheduling app • Inventory management app • App for storing photos, videos, and important files
es: • App para gestión de clientes • App para gestión de turnos • App para gestión de stock • App para almacenamiento de fotos, videos y archivos importantes
it: • App per la gestione dei clienti • App per la gestione degli appuntamenti • App per la gestione dell’inventario • App per l’archiviazione di foto, video e file importanti

# serviceWebExamples
source: • Online booking platform • Customer portal with login and private area • Order management system • Corporate website with admin panel
es: • Plataforma de reservas online • Portal de clientes con login y área privada • Sistema de gestión de pedidos • Sitio institucional con panel de administración
it: • Piattaforma di prenotazioni online • Portale clienti con login e area riservata • Sistema di gestione ordini • Sito aziendale con pannello di amministrazione

# serviceSqlExamples
source: • Database for user and client management • Database for inventory and stock • Financial transaction records • Custom reporting systems
es: • Base de datos para gestión de usuarios y clientes • Base de datos para inventarios y stock • Registro de transacciones financieras • Sistemas de reportes personalizados
it: • Database per la gestione di utenti e clienti • Database per inventario e magazzino • Registri di transazioni finanziarie • Sistemi di reportistica personalizzata

# serviceProductExamples
source: • Development of a portable electronic device • Creation of a consumer product with IoT connectivity • Medical equipment under quality standards • Automation systems for small and medium businesses
es: • Desarrollo de un dispositivo electrónico portátil • Creación de un producto de consumo con conectividad IoT • Equipos médicos bajo normativas de calidad • Sistemas de automatización para pymes
it: • Sviluppo di un dispositivo elettronico portatile • Creazione di un prodotto di consumo con connettività IoT • Apparecchiature mediche conformi agli standard di qualità • Sistemi di automazione per PMI

# servicePcbExamples
source: • PCB design for medical equipment • PCBs for consumer electronics • Boards for industrial control systems • Design optimization to reduce manufacturing costs
es: • Diseño de PCB para equipos médicos • PCB para dispositivos de consumo masivo • Placas para sistemas de control industrial • Optimización de diseños para reducir costos de fabricación
it: • Progettazione PCB per apparecchiature mediche • PCB per dispositivi di consumo • Schede per sistemi di controllo industriale • Ottimizzazione dei progetti per ridurre i costi di produzione

# servicePrototypeExamples
source: • Prototype of an IoT device with sensors • Prototype of an application integrated with hardware • Early validation of an electronic product • Prototypes for investor presentations or trade shows
es: • Prototipo de un dispositivo IoT con sensores • Prototipo de una aplicación integrada con hardware • Validación temprana de un producto electrónico • Prototipos para presentaciones a inversores o ferias
it: • Prototipo di un dispositivo IoT con sensori • Prototipo di un’applicazione integrata con hardware • Validazione precoce di un prodotto elettronico • Prototipi per presentazioni a investitori o fiere

# serviceOptimizationExamples
source: • Cost reduction in electronics manufacturing • Optimization of calibration and control times • Standardization of software processes • Improvement in product traceability
es: • Reducción de costos en la producción de electrónica • Optimización de tiempos de calibración y control • Estandarización de procesos de software • Mejora en la trazabilidad de productos
it: • Riduzione dei costi nella produzione elettronica • Ottimizzazione dei tempi di calibrazione e controllo • Standardizzazione dei processi software • Miglioramento della tracciabilità dei prodotti

# serviceIotExamples
source: • Remote sensor monitoring system • Industrial device control via app • Smart home and office automation solutions • Connected devices with cloud storage
es: • Sistema de monitoreo remoto de sensores • Control de dispositivos industriales desde una app • Soluciones de domótica para hogares y oficinas • Dispositivos conectados con almacenamiento en la nube
it: • Sistema di monitoraggio remoto dei sensori • Controllo di dispositivi industriali tramite app • Soluzioni di domotica per case e uffici • Dispositivi connessi con archiviazione cloud

# serviceIosExamples
source: • Appointment and booking app for iPhone • Business management app for iPad • Cloud storage application • Custom solutions for startups and SMEs
es: • App para reservas y turnos en iPhone • App de gestión empresarial para iPad • Aplicación de almacenamiento en la nube • Soluciones personalizadas para startups y pymes
it: • App per prenotazioni e appuntamenti su iPhone • App di gestione aziendale per iPad • Applicazione di archiviazione cloud • Soluzioni personalizzate per startup e PMI

# flipCardFalseKnowMore
source: Learn more...
es: Conocer más...
it: Scopri di più...

# flipCardTrueKnowMore
source: Discover even more...
es: Conocer aún más...
it: Scopri ancora di più...

# flipCardPopupClose
source: Close
es: Cerrar
it: Chiudi

# languageEnglish
source: 🇺🇸 English
it: 🇺🇸 Inglese
