Repository: jnahuel-developer/landing_page
Catalog: lib/l10n/app_*.arb
Languages: es, it

# headerTitle
source: Nahuel Martínez - Developer
es: Nahuel Martínez - Desarrollador
it: Nahuel Martínez - Sviluppatore

source: Login
es: Loguearse
it: Accedi

source: Services
es: Servicios
it: Servizi

source: Contact
es: Contacto
it: Contatto

# languageSpanish
source: 🇦🇷 Spanish
es: 🇦🇷 Español
it: 🇦🇷 Spagnolo

# languageItalian
source: 🇮🇹 Italian
es: 🇮🇹 Italiano
it: 🇮🇹 Italiano

# heroMain
source: Electronic Engineer & Freelance Developer
es: Ingeniero Electrónico & Desarrollador Freelance
it: Ingegnere Elettronico & Sviluppatore Freelance

# heroExpanded
source: Software • Hardware • Android • Web • Research • Process Optimization
es: Software • Hardware • Android • Web • Investigación • Optimización de procesos
it: Software • Hardware • Android • Web • Ricerca • Ottimizzazione dei processi

# aboutTitle
source: About Me
es: Sobre mí
it: Chi sono...

# aboutShowMore
source: Show more
es: Conocer más
it: Scopri di più

# aboutShortDescription
source: I am an Electronic Engineer with more than seven years of experience in software and product development, having worked in industries with high demands on quality and ISO design standards. Today I offer freelance development services, designing and creating digital solutions tailored to your needs: applications, websites, and management systems that integrate cloud services and APIs, so you get exactly what your project requires.
es: Soy Ingeniero Electrónico con más de siete años de experiencia en el desarrollo de software y productos, habiendo trabajado en industrias altamente exigentes en el cumplimiento de normativas de calidad y diseño ISO. Hoy ofrezco servicios de desarrollo freelance, diseñando y creando soluciones digitales a tu medida: aplicaciones, sitios web y sistemas de gestión que integran servicios en la nube y APIs, para que tengas exactamente lo que tu proyecto necesita.
it: Sono un Ingegnere Elettronico con oltre sette anni di esperienza nello sviluppo di software e prodotti, avendo lavorato in settori altamente esigenti nel rispetto delle normative di qualità e degli standard di progettazione ISO. Oggi offro servizi di sviluppo freelance, progettando e realizzando soluzioni digitali su misura per le tue esigenze: applicazioni, siti web e sistemi di gestione che integrano servizi cloud e API, così avrai esattamente ciò di cui il tuo progetto ha bisogno.

# aboutDescription
source: I am an Electronic Engineer with more than seven years of experience in software, firmware, and application development, with a background in highly demanding sectors such as the medical and financial industries. My technical training, combined with hands-on experience in regulated environments, allows me to approach complex projects with a comprehensive vision: from initial conception to final implementation, ensuring quality, efficiency, and regulatory compliance. Throughout my career I have been involved in high-impact projects, including the creation and commercialization of certified medical devices and the development of critical software solutions for financial systems. These projects required not only a strong command of programming languages, but also the ability to manage quality under international standards such as ISO 13485. Thanks to these experiences, I have achieved measurable results such as reducing production costs, optimizing quality control processes, and implementing robust and secure solutions in production environments. In my current role as a freelance developer, I specialize in designing and building cross-platform mobile applications using Flutter, with integrations in Firebase, external APIs, and cloud services. My goal is to deliver scalable, secure, and user-oriented applications that provide real value to organizations. The industry experience I have gained enables me to translate business needs into viable technological solutions, balancing innovation, quality, and efficiency.
es: Soy Ingeniero Electrónico con más de siete años de experiencia en el desarrollo de software, firmware y aplicaciones, con trayectoria en sectores altamente exigentes como la industria médica y la financiera. Mi formación técnica, sumada a la experiencia práctica en entornos regulados, me permite abordar proyectos complejos con una visión integral: desde la concepción inicial hasta la implementación final, asegurando calidad, eficiencia y cumplimiento normativo. A lo largo de mi carrera he participado en proyectos de alto impacto, entre ellos la creación y puesta en el mercado de dispositivos médicos certificados y el desarrollo de soluciones de software críticas para sistemas financieros. Estos proyectos no solo exigieron un dominio profundo de lenguajes de programación, sino también la capacidad de gestionar calidad bajo normas internacionales como ISO 13485. Gracias a estas experiencias he logrado resultados concretos, como la reducción de costos productivos, la optimización de procesos de control de calidad y la implementación de soluciones robustas y seguras en entornos de producción. En mi rol actual como desarrollador freelance, me especializo en el diseño y construcción de aplicaciones móviles multiplataforma utilizando Flutter, con integraciones en Firebase, APIs externas y servicios en la nube. Mi objetivo es entregar aplicaciones escalables, seguras y orientadas al usuario final, que aporten valor real a las organizaciones. La experiencia adquirida en la industria me permite traducir necesidades de negocio en soluciones tecnológicas viables, equilibrando innovación, calidad y eficiencia.
it: Sono un Ingegnere Elettronico con oltre sette anni di esperienza nello sviluppo di software, firmware e applicazioni, con un percorso in settori altamente esigenti come quello medico e finanziario. La mia formazione tecnica, unita all’esperienza pratica in ambienti regolamentati, mi consente di affrontare progetti complessi con una visione completa: dalla concezione iniziale fino all’implementazione finale, garantendo qualità, efficienza e conformità normativa. Nel corso della mia carriera ho partecipato a progetti di grande impatto, tra cui la creazione e la commercializzazione di dispositivi medici certificati e lo sviluppo di soluzioni software critiche per sistemi finanziari. Questi progetti hanno richiesto non solo una solida padronanza di linguaggi di programmazione, ma anche la capacità di gestire la qualità secondo standard internazionali come ISO 13485. Grazie a queste esperienze ho ottenuto risultati concreti, come la riduzione dei costi produttivi, l’ottimizzazione dei processi di controllo qualità e l’implementazione di soluzioni robuste e sicure in ambienti di produzione. Nel mio ruolo attuale di sviluppatore freelance, mi specializzo nella progettazione e realizzazione di applicazioni mobili multipiattaforma utilizzando Flutter, con integrazioni in Firebase, API esterne e servizi cloud. Il mio obiettivo è fornire applicazioni scalabili, sicure e orientate all’utente, che apportino valore reale alle organizzazioni. L’esperienza maturata nel settore mi consente di tradurre le esigenze aziendali in soluzioni tecnologiche realizzabili, bilanciando innovazione, qualità ed efficienza.

# aboutLinkedin
source: Career
es: Carrera
it: Carriera

# aboutGithub
source: Projects
es: Proyectos
it: Progetti

# aboutPhone
source: Let's talk
es: Hablemos
it: Parliamo

# aboutEmail
source: Contact
es: Contacto
it: Contatto

# aboutPresentation
source: See presentation
es: Ver presentación

# servicesSectionTitle
source: Services
es: Servicios
it: Servizi

# serviceSqlTitle
source: Databases
es: Bases de datos
it: Basi di dati

# serviceProductTitle
source: Product
es: Producto
it: Prodotto

# servicePrototypeTitle
source: Prototyping
es: Prototipado
it: Prototipazione

# serviceOptimizationTitle
source: Process Optimization
es: Optimización de procesos
it: Ottimizzazione dei processi

# serviceAndroidDescription
source: Development of modern and user-friendly Android applications, designed to deliver the best experience to your customers and integrated with cloud services and APIs.
es: Desarrollo de aplicaciones Android modernas y fáciles de usar, pensadas para ofrecer la mejor experiencia a tus clientes e integradas con servicios en la nube y APIs.
it: Sviluppo di applicazioni Android moderne e intuitive, progettate per offrire la migliore esperienza ai tuoi clienti e integrate con servizi cloud e API.

# serviceWebDescription
source: Design and development of scalable web applications and websites, adapted to any device and focused on performance and user experience.
es: Diseño y desarrollo de sitios y aplicaciones web escalables, adaptadas a cualquier dispositivo y enfocadas en el rendimiento y la experiencia del usuario.
it: Progettazione e sviluppo di siti e applicazioni web scalabili, adattate a qualsiasi dispositivo e focalizzate su prestazioni ed esperienza utente.

# serviceSqlDescription
source: Creation and management of optimized SQL databases, ensuring stability, security, and scalability for your applications and systems.
es: Creación y gestión de bases de datos SQL optimizadas, asegurando la estabilidad, seguridad y escalabilidad de tus aplicaciones y sistemas.
it: Creazione e gestione di database SQL ottimizzati, garantendo stabilità, sicurezza e scalabilità per le tue applicazioni e sistemi.

# serviceProductDescription
source: Comprehensive support in the development of technology products, from the initial idea to a market-ready solution.
es: Acompañamiento integral en el desarrollo de productos tecnológicos, desde la idea inicial hasta una solución lista para el mercado.
it: Supporto completo nello sviluppo di prodotti tecnologici, dall’idea iniziale fino a una soluzione pronta per il mercato.

# servicePcbDescription
source: Design of schematics and printed circuit boards (PCBs) with a focus on efficiency and cost reduction, meeting high quality standards.
es: Diseño de esquemáticos y placas electrónicas (PCB) con foco en la eficiencia y la reducción de costos productivos, cumpliendo altos estándares de calidad.
it: Progettazione di schemi e circuiti stampati (PCB) con attenzione all’efficienza e alla riduzione dei costi produttivi, rispettando elevati standard di qualità.

# servicePrototypeDescription
source: Development of functional electronic prototypes to validate ideas, speed up testing, and facilitate the evolution into final products.
es: Desarrollo de prototipos electrónicos funcionales para validar ideas, acelerar pruebas y facilitar la evolución hacia productos finales.
it: Sviluppo di prototipi elettronici funzionali per validare idee, accelerare i test e facilitare l’evoluzione verso i prodotti finali.

# serviceOptimizationDescription
source: Analysis and optimization of production and software processes, reducing costs and improving delivery times without compromising quality.
es: Análisis y optimización de procesos productivos y de software, reduciendo costos y mejorando tiempos de entrega sin sacrificar calidad.
it: Analisi e ottimizzazione dei processi produttivi e software, riducendo i costi e migliorando i tempi di consegna senza compromettere la qualità.

# serviceIotDescription
source: Internet of Things solutions that integrate hardware and software, connecting devices to generate data and create new business opportunities.
es: Soluciones de Internet of Things que integran hardware y software, conectando dispositivos para generar datos y crear nuevas oportunidades de negocio.
it: Soluzioni di Internet of Things che integrano hardware e software, collegando dispositivi per generare dati e creare nuove opportunità di business.

# serviceIosDescription
source: Development of iOS applications with a smooth and reliable experience, integrated with cloud services and tailored to your users’ needs.
es: Desarrollo de aplicaciones para iOS con una experiencia fluida y confiable, integradas con servicios en la nube y adaptadas a las necesidades de tus usuarios.
it: Sviluppo di applicazioni iOS con un’esperienza fluida e affidabile, integrate con servizi cloud e adattate alle esigenze dei tuoi utenti.

# serviceAndroidLongDescription
source: Custom Android application development tailored to the specific needs of your business or project. I create intuitive and modern solutions that enhance user experience, integrating cloud services, notifications, authentication systems, and real-time data synchronization. My developments are always designed to be scalable, secure, and easy to maintain, ensuring your investment pays off in the long term.
es: Desarrollo de aplicaciones Android personalizadas, diseñadas para adaptarse a las necesidades específicas de tu negocio o proyecto. Creo soluciones intuitivas y modernas que mejoran la experiencia del usuario, integrando servicios en la nube, notificaciones, sistemas de autenticación y sincronización de datos en tiempo real. Mis desarrollos buscan siempre ser escalables, seguros y fáciles de mantener, para que tu inversión rinda a largo plazo.
it: Sviluppo di applicazioni Android personalizzate, progettate per adattarsi alle esigenze specifiche della tua attività o progetto. Creo soluzioni intuitive e moderne che migliorano l’esperienza dell’utente, integrando servizi cloud, notifiche, sistemi di autenticazione e sincronizzazione dei dati in tempo reale. I miei sviluppi sono sempre pensati per essere scalabili, sicuri e facili da mantenere, garantendo un investimento solido e duraturo.

# serviceWebLongDescription
source: Design and development of modern web applications, accessible from any device and focused on delivering the best user experience. I build websites and systems with attractive and fast interfaces, adapted to your business needs, whether to provide information, manage internal processes, or create interactive platforms for your customers. Each project is designed to grow over time, integrating with databases, cloud services, and external APIs.
es: Diseño y desarrollo de aplicaciones web modernas, accesibles desde cualquier dispositivo y pensadas para ofrecer la mejor experiencia al usuario. Construyo sitios y sistemas con interfaces atractivas y rápidas, que se adaptan a las necesidades de tu negocio, ya sea para brindar información, gestionar procesos internos o crear plataformas interactivas para tus clientes. Cada desarrollo está pensado para crecer en el tiempo, integrándose con bases de datos, servicios en la nube y APIs externas.
it: Progettazione e sviluppo di applicazioni web moderne, accessibili da qualsiasi dispositivo e pensate per offrire la migliore esperienza utente. Realizzo siti e sistemi con interfacce attraenti e veloci, adattati alle esigenze della tua attività, sia per fornire informazioni, gestire processi interni o creare piattaforme interattive per i tuoi clienti. Ogni progetto è pensato per crescere nel tempo, integrandosi con database, servizi cloud e API esterne.

# serviceSqlLongDescription
source: Design and management of robust SQL databases that ensure efficient, secure, and reliable handling of your business’s critical information. Each database is structured for scalability and fast access, guaranteeing the stability of the applications that rely on it. In addition, I implement security and backup best practices so that your data is always protected.
es: Diseño y administración de bases de datos SQL robustas, que aseguran el manejo eficiente, seguro y confiable de la información crítica de tu negocio. Cada base de datos se estructura pensando en la escalabilidad y en la velocidad de acceso, garantizando la estabilidad de las aplicaciones que la utilizan. Además, implemento buenas prácticas de seguridad y respaldo, para que tus datos estén siempre protegidos.
it: Progettazione e gestione di database SQL robusti, che garantiscono la gestione efficiente, sicura e affidabile delle informazioni critiche della tua attività. Ogni database è strutturato per scalabilità e rapidità di accesso, assicurando la stabilità delle applicazioni che lo utilizzano. Inoltre, applico le migliori pratiche di sicurezza e backup per mantenere i tuoi dati sempre protetti.

# serviceProductLongDescription
source: I provide end-to-end support in the development of technological products, from the initial idea to market launch. This includes planning, design, and execution of each stage, ensuring the final result not only meets your expectations but also complies with quality and efficiency standards. I work closely with you to transform an idea into a real product, optimizing costs and reducing risks along the way.
es: Acompaño el desarrollo completo de productos tecnológicos, desde la idea inicial hasta la puesta en marcha. Esto incluye la planificación, diseño y ejecución de cada etapa, buscando que el resultado final no solo cumpla con tus expectativas, sino que también se adapte a estándares de calidad y eficiencia productiva. Trabajo junto a vos para convertir una idea en un producto real, optimizando costos y reduciendo riesgos en el camino.
it: Offro supporto completo nello sviluppo di prodotti tecnologici, dall’idea iniziale fino al lancio sul mercato. Questo include pianificazione, progettazione ed esecuzione di ogni fase, garantendo che il risultato finale non solo soddisfi le tue aspettative, ma rispetti anche standard di qualità ed efficienza. Lavoro al tuo fianco per trasformare un’idea in un prodotto reale, ottimizzando i costi e riducendo i rischi lungo il percorso.

# servicePcbLongDescription
source: Design of printed circuit boards (PCBs) and electronic schematics optimized to ensure the best balance between quality, functionality, and production costs. Each design takes into account quality standards, component compatibility, and ease of assembly, reducing risks and improving manufacturing efficiency. My goal is to help you turn your ideas into reliable and production-ready electronic boards.
es: Diseño de circuitos impresos (PCB) y esquemáticos electrónicos optimizados para garantizar la mejor relación entre calidad, funcionalidad y costos de producción. Cada diseño se realiza teniendo en cuenta normativas de calidad, compatibilidad de componentes y facilidad de montaje, reduciendo riesgos y mejorando la eficiencia en la fabricación. Mi objetivo es ayudarte a transformar tus ideas en placas electrónicas listas para la producción, confiables y sostenibles en el tiempo.
it: Progettazione di circuiti stampati (PCB) e schemi elettronici ottimizzati per garantire il miglior equilibrio tra qualità, funzionalità e costi di produzione. Ogni progetto viene realizzato tenendo conto degli standard di qualità, della compatibilità dei componenti e della facilità di assemblaggio, riducendo i rischi e migliorando l’efficienza produttiva. Il mio obiettivo è aiutarti a trasformare le tue idee in schede elettroniche pronte per la produzione, affidabili e sostenibili nel tempo.

# servicePrototypeLongDescription
source: Development of electronic prototypes that allow you to quickly validate an idea before moving to mass production. Prototyping is key to testing functionalities, identifying improvements, and reducing future costs, ensuring the final product meets the proposed objectives. I work closely with you to take your project from concept to functional prototype in the shortest possible time.
es: Desarrollo de prototipos electrónicos que permiten validar rápidamente una idea antes de llevarla a la producción en serie. El prototipado es clave para probar funcionalidades, detectar mejoras y reducir costos futuros, asegurando que el producto final cumpla con los objetivos propuestos. Trabajo en estrecha colaboración para que tu proyecto pase de concepto a prototipo funcional en el menor tiempo posible.
it: Sviluppo di prototipi elettronici che consentono di validare rapidamente un’idea prima della produzione di massa. La prototipazione è fondamentale per testare funzionalità, individuare miglioramenti e ridurre i costi futuri, garantendo che il prodotto finale rispetti gli obiettivi prefissati. Lavoro al tuo fianco per trasformare il progetto da concetto a prototipo funzionale nel minor tempo possibile.

# serviceOptimizationLongDescription
source: Analysis and improvement of production and software processes to increase efficiency, reduce costs, and improve quality. My experience in regulated industries allows me to identify bottlenecks, propose practical solutions, and apply quality standards that directly impact productivity. The goal is to make your processes more agile, reliable, and sustainable over time.
es: Análisis y mejora de procesos productivos y de software con el fin de aumentar la eficiencia, reducir costos y mejorar la calidad. Mi experiencia en industrias reguladas me permite detectar cuellos de botella, proponer soluciones prácticas y aplicar estándares de calidad que impactan directamente en la productividad. El objetivo es que tus procesos sean más ágiles, confiables y sostenibles en el tiempo.
it: Analisi e miglioramento dei processi produttivi e software per aumentare l’efficienza, ridurre i costi e migliorare la qualità. La mia esperienza in settori regolamentati mi permette di individuare colli di bottiglia, proporre soluzioni pratiche e applicare standard di qualità che hanno un impatto diretto sulla produttività. L’obiettivo è rendere i tuoi processi più agili, affidabili e sostenibili nel tempo.

# serviceIotLongDescription
source: Development of Internet of Things solutions that connect physical devices with digital platforms, generating valuable information and new business opportunities. I integrate hardware and software into connected systems focused on data collection, real-time communication, and ease of use. This allows you to monitor, automate, and scale your projects efficiently and reliably.
es: Desarrollo de soluciones de Internet of Things que conectan dispositivos físicos con plataformas digitales, generando información valiosa y nuevas oportunidades de negocio. Integro hardware y software en sistemas conectados, con foco en la recolección de datos, la comunicación en tiempo real y la facilidad de uso. Esto te permite monitorear, automatizar y escalar tus proyectos de manera eficiente y confiable.
it: Sviluppo di soluzioni Internet of Things che collegano dispositivi fisici a piattaforme digitali, generando informazioni preziose e nuove opportunità di business. Integro hardware e software in sistemi connessi, con focus sulla raccolta dati, comunicazione in tempo reale e facilità d’uso. Questo ti permette di monitorare, automatizzare e scalare i tuoi progetti in modo efficiente e affidabile.
